# make sure brew is up to date
# brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'
tap 'sass/sass'

# Install Bash
brew 'bash'

# Install Binaries
brew 'git'
brew 'gh'
brew 'vcprompt'
brew 'mas'
brew 'trash'

# Install Javascript Packages
brew 'yarn'
brew 'node'
brew 'nvm'
brew 'eslint'
brew 'sass/sass/sass'

# Databases
brew 'mongodb-community'
brew 'mysql'
brew 'postgresql'
brew 'sqlite'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'spectacle'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'mongodb-compass'
cask 'zoom'
cask 'postman'
cask 'visual-studio-code'
cask 'mysqlworkbench'
cask 'kite'

# Install App Store Apps
mas 'Xcode', id: 497799835
mas 'Microsoft Word', id: 462054704
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
